xorg
xorg-xinit
xorg-server
rofi
feh
xdg-utils
xdg-user-dirs
i3-wm
autotiling-git
xss-lock
firefox
kdeconnect
ueberzug
neovim
pulseaudio
pulseaudio-alsa
pulseaudio-jack
pavucontrol
lxsession
dunst
pcmanfm-gtk3
gvfs
npm
nodejs
python-pip
pluma
xsel
pamixer
kitty
qt5-tools
htop
ranger
neofetch
scrot
lxappearance
breeze
breeze-gtk
papirus-icon-theme
archlinux-wallpaper
polybar
gsimplecal
picom-git
nerd-fonts-jetbrains-mono
zoom
betterlockscreen
noisetorch-bin
pamac-aur
rng-tools
dbus-broker
